import re

# 打开文件并读取内容
# with open('file_a.txt', 'r') as file:
#     content = file.read()
content = """00001000@!@aimi@!@2021-01-01@!@ 00000000000000000000.000000@!@uu1@!@ 00000000000000000000.000000
00002000@!@bimi@!@2022-01-01@!@-00000000000000000000.000028@!@uuua22@!@ 00000000000000000000.000000
00002000@!@bimi@!@2022-01-01@!@-00000000000000000000.00002800@!@uuua22@!@ 00000000000000000000.000000
00003001@!@cimi@!@2023-01-01@!@ 00000000000000000000.000028@!@uuua3@!@ 0003.00
00003001@!@cimi@!@2023-01-01@!@ 00000000000000000000.00002800@!@uuua3@!@ 0003.00
00004001@!@dimi@!@2024-01-01@!@ 00000000000000000100.000000@!@uuua4@!@ 0004.00
00005001@!@eimi@!@2025-01-01@!@ 00000000000000002515.825440@!@uuua5@!@ 00000000000000000000.000000
000060001@!@fimi@!@2026-01-01@!@-00000000000000002515.825440@!@uuua5@!@ 00000000000000000000.000000
00007001@!@himi@!@2027-01-01@!@ 00000000000000002515.825441@!@uuua5@!@ 00000000000000000000.000000"""

with open('file_a.txt', 'r') as file:
    content = file.read()
# 定义正则表达式模式，用于匹配数字后面的零
# pattern = r'(-?)0+(\.0*|\.[1-9][0-9]*)?'
# pattern = r'^.0+|0+$'
# 使用 re.sub 函数进行替换
# new_content = re.sub(pattern, lambda x: x.group(1) + (x.group(2) or ''), content)

# 复制1001行
# 替换 000.000格式数据为0
content = re.sub(r'(@) 0+(0)\.0+([@\n])', r'\1\2\3', content)
# print(content)
# 去除正数小数点两边多余的0
content = re.sub(r'(@) 0+([0-9]*\.)|\.0+([@\n])', r'\1\2\3', content)
# 去除负数小数点两边多余的0
content = re.sub(r'(@-)0+([0-9]*\.)|\.0+([@\n])', r'\1\2\3', content)

content = re.sub(r'(\.\d*?)0+(?=\D|$)', r'\1', content)

# content = re.sub(r'(@) 0+([0-9]*\.[1-9]*)0+([@\n])', r'\1\2\3', content)

# content = re.sub(r'@\.@', r'@0@', content)
# content = re.sub(r'@\.\n', r'@0\n', content)

print(content)


