蒋城杰 7的工时相等
杨梦童 7的工时相等
张丽 7的工时相等
王广丽 7的工时相等
李志方 7的工时相等
毛震远 7的工时相等
安天琪 7的工时相等
陈龙 7的工时相等
黄逸豪 7的工时相等
吴铃枝 7的工时相等
周倩倩 7的工时相等
马旺 7的工时相等
韩展飞 7的工时相等
孙剑 7的工时相等
王雁 7的工时相等
万里飞 7的工时相等
凌坤 7的工时相等
严仇鹏 7的工时不相等！！，高伟达工时：22.0 兴业工时：22.5
汪楚皓 7的工时相等
仲德晗 7的工时相等
韩亚 7的工时相等
李馨海 7的工时相等
文锐 7的工时相等
高凯颖 7的工时相等
龚诗琪 7的工时相等
张雷 7的工时相等
曾潮倩 7的工时相等
王俊令 7的工时相等
李昱阳 7的工时相等
何艳娇 7的工时相等
--------------------------------------------------------------------------------
蒋城杰 8的工时相等
杨梦童 8的工时相等
李志方 8的工时相等
毛震远 8的工时相等
陈龙 8的工时相等
王广丽 8的工时不相等！！，高伟达工时：21.0 兴业工时：18.0
安天琪 8的工时不相等！！，高伟达工时：21.0 兴业工时：18.0
张丽 8的工时相等
宋叶林 8的工时相等
周倩倩 8的工时相等
万里飞 8的工时相等
黄逸豪 8的工时相等
王雁 8的工时相等
马旺 8的工时相等
孙剑 8的工时相等
吴铃枝 8的工时相等
韩展飞 8的工时相等
凌坤 8的工时相等
汪楚皓 8的工时不相等！！，高伟达工时：21.0 兴业工时：20.5
严仇鹏 8的工时相等
韩亚 8的工时相等
仲德晗 8的工时不相等！！，高伟达工时：21.0 兴业工时：18.0
龚诗琪 8的工时相等
高凯颖 8的工时相等
李馨海 8的工时相等
何艳娇 8的工时相等
文锐 8的工时相等
曾潮倩 8的工时相等
张雷 8的工时相等
李昱阳 8的工时相等
王俊令 8的工时相等
杨成 8的工时相等
唐维民 8的工时不相等！！，高伟达工时：11.0 兴业工时：10.5
孟华 8的工时不相等！！，高伟达工时：15.0 兴业工时：6.0
--------------------------------------------------------------------------------
杨梦童 9的工时相等
蒋城杰 9的工时不相等！！，高伟达工时：19.5 兴业工时：20.0
张丽 9的工时相等
宋叶林 9的工时相等
毛震远 9的工时相等
陈龙 9的工时相等
李志方 9的工时相等
安天琪 9的工时不相等！！，高伟达工时：21.0 兴业工时：20.0
王广丽 9的工时相等
周倩倩 9的工时相等
万里飞 9的工时相等
韩展飞 9的工时相等
王雁 9的工时相等
黄逸豪 9的工时相等
孙剑 9的工时相等
马旺 9的工时相等
吴铃枝 9的工时相等
严仇鹏 9的工时相等
汪楚皓 9的工时不相等！！，高伟达工时：23.0 兴业工时：22.5
仲德晗 9的工时相等
凌坤 9的工时相等
韩亚 9的工时相等
李馨海 9的工时相等
龚诗琪 9的工时相等
李昱阳 9的工时相等
高凯颖 9的工时相等
杨成 9的工时相等
唐维民 9的工时相等
张雷 9的工时相等
文锐 9的工时相等
何艳娇 9的工时不相等！！，高伟达工时：22.5 兴业工时：22.0
曾潮倩 9的工时相等
左雅琪 9的工时不相等！！，高伟达工时：18.5 兴业工时：19.0
李帅 9的工时相等
王承建 9的工时相等





-------------------------------------------------------

之前的
严仇鹏 7月的工时不相等！！高伟达工时：22.0 兴业工时：22.5
王广丽 8月的工时不相等！！高伟达工时：21.0 兴业工时：18.0
安天琪 8月的工时不相等！！高伟达工时：21.0 兴业工时：18.0
汪楚皓 8月的工时不相等！！高伟达工时：21.0 兴业工时：20.5
仲德晗 8月的工时不相等！！高伟达工时：21.0 兴业工时：18.0
唐维民 8月的工时不相等！！高伟达工时：11.0 兴业工时：10.5
孟华  8月的工时不相等！！高伟达工时：15.0 兴业工时：6.0
蒋城杰 9月的工时不相等！！高伟达工时：19.5 兴业工时：20.0
安天琪 9月的工时不相等！！高伟达工时：21.0 兴业工时：20.0
汪楚皓 9月的工时不相等！！高伟达工时：23.0 兴业工时：22.5
何艳娇 9月的工时不相等！！高伟达工时：22.5 兴业工时：22.0
左雅琪 9月的工时不相等！！高伟达工时：18.5 兴业工时：19.0


现在的
严仇鹏 7的工时不相等！！，高伟达工时：22.0 兴业工时：22.5
安天琪 8的工时不相等！！，高伟达工时：21.0 兴业工时：20.0
汪楚皓 8的工时不相等！！，高伟达工时：21.0 兴业工时：20.5
唐维民 8的工时不相等！！，高伟达工时：11.0 兴业工时：10.5
蒋城杰 9的工时不相等！！，高伟达工时：19.5 兴业工时：20.0
汪楚皓 9的工时不相等！！，高伟达工时：23.0 兴业工时：22.5
何艳娇 9的工时不相等！！，高伟达工时：22.5 兴业工时：22.0
左雅琪 9的工时不相等！！，高伟达工时：18.5 兴业工时：19.0






























D:\AppGallery\Software\python\python.exe D:\cl\dreams\project\compare_timesheet.py
--------------------------------------------------------------------------------
孙剑 10的工时不相等！！，高伟达工时：9.0 兴业工时：18.0            无需补救
韩展飞 10的工时不相等！！，高伟达工时：18.0 兴业工时：17.0
韩亚 10的工时不相等！！，高伟达工时：18.0 兴业工时：17.0
仲德晗 10的工时不相等！！，高伟达工时：9.0 兴业工时：8.0
--------------------------------------------------------------------------------
蒋城杰 11的工时不相等！！，高伟达工时：17.5 兴业工时：19.5        无需补救
安天琪 11的工时不相等！！，高伟达工时：20.0 兴业工时：19.0
陈龙 11的工时不相等！！，高伟达工时：13.0 兴业工时：18.0         无需补救
孙剑 11的工时不相等！！，高伟达工时：0 兴业工时：20.0            无需补救
黄逸豪 11的工时不相等！！，高伟达工时：18.0 兴业工时：17.0
马旺 11的工时不相等！！，高伟达工时：20.0 兴业工时：18.0
龚诗琪 11的工时不相等！！，高伟达工时：19.0 兴业工时：20.0       无需补救
张雷 11的工时不相等！！，高伟达工时：20.0 兴业工时：18.0
刘洪年 11的工时不相等！！，高伟达工时：20.0 兴业工时：19.0
唐维民 11的工时不相等！！，高伟达工时：14.0 兴业工时：16.0       无需补救


